Revit 2027 API
AnalysisMode Enumeration
 This enum is used to define the Energy Analysis Model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisMode
Public Enumeration AnalysisMode
public enum class AnalysisMode
type AnalysisMode
Members
Member name | Value | Description
BuildingElements | 0 |  Energy Analysis Model based on building elements. This value is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the 'ConceptualMassesAndBuildingElements' option instead.
ConceptualMassesAndBuildingElements | 2 |  Energy Analysis Model based on conceptual masses and building elements.
RoomsOrSpaces | 3 |  Energy Analysis Model based on spatial elements. This mode uses volumes based on rooms or spaces defined in the building model.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace